---
kind: type
id: T:Autodesk.Revit.DB.Visual.SchemaCommon
source: html/7457e8b2-6199-b234-fec2-e685e5fb7c69.htm
---
# Autodesk.Revit.DB.Visual.SchemaCommon

A static class that provides access to the property names that appear in all the visual Asset types.

## Syntax (C#)
```csharp
public static class SchemaCommon
```